{"meta":{"code":200,"requestId":"58605218dd57972f37b9af63"},"response":{"menu":{"provider":{"name":"singleplatform","attributionImage":"https:\/\/as.singleplatform.com\/Foursquare\/burger-king-6765\/provided_by.png","attributionLink":"http:\/\/w.singlepage.com\/burger-king-6765\/menu?ref=Foursquare","attributionText":"Disclaimer: Always check with the business for pricing and availability of menu items. SinglePlatform is not responsible for menu or pricing changes, but the information is believed to be accurate when posted. Listing of a menu does not mean that there is any affiliation, endorsement or sponsorship between SinglePlatform and the listed business."},"menus":{"count":1,"items":[{"menuId":"m1a1tq3492oxgns3mr2s34ti7","name":"Main Menu","description":"","entries":{"count":6,"items":[{"sectionId":"s441882","name":"Salads","entries":{"count":3,"items":[{"entryId":"3083380","name":"Tendercrisp Garden Salad","description":"Season-ripe lettuce, carrots, and tomatoes topped with crispy chicken, three kinds of cheese, and your choice of ken's salad dressing. tendercrisp is the salad for chicken-lovers."},{"entryId":"3083381","name":"Garden Salad","description":"Man doesnt live on flame-broiled burgers alone. try the bk garden salad as a satisfying accompaniment to any meal. or as a meal in itself. croutons are included in nutritional information. price and participation may vary. prices higher in ak & hi."},{"entryId":"3083382","name":"Tendergrilltm Garden Salad","description":"Season-ripe lettuce, carrots, and tomatoes topped with grilled chicken, three kinds of cheese, and your choice of ken's salad dressing. tendergrillTM is the salad for grilled-chicken lovers."}]}},{"sectionId":"s441883","name":"Flame-Broiled Burgers","entries":{"count":16,"items":[{"entryId":"3083383","name":"Whopper","description":"A 14 pound of flame-broiled beef, ripe tomatoes, crisp lettuce, creamy mayo, ketchup, crunchy pickles and onions on a toasted sesame seed bun. its americas favorite burger. the original. the whopper. based on pre-cooked patty weight. based on preference."},{"entryId":"3083384","name":"Double Whopper","description":"Two flame-broiled beef patties stacked high with red ripe tomatoes, crisp lettuce, creamy mayo, ketchup, crunchy pickles, and onions all on a toasted sesame seed bun. double the whopper patties, double the satisfaction."},{"entryId":"3083385","name":"Triple Whopper","description":"Three flame-broiled beef patties with two slices of american cheese, crisp lettuce, creamy mayo, red ripe tomatoes, pickles and onionsall on a toasted sesame seed bun. its once, twice, three times the tasty, and its waiting for you at burger king"},{"entryId":"3083386","name":"Whopper Jr.","description":"Its a little whopper sandwich with a big taste. a flame-broiled beef patty topped with red ripe tomatoes, crisp lettuce, creamy mayo, ketchup, crunchy pickles, and onions-all on a toasted sesame seed bun."},{"entryId":"3083387","name":"Bk Single Stacker","description":"Behold 1 patty, 1 slice of cheese & 2 half slices of bacon smothered in bk stacker sauce. this flame-broiled starter stacker is a most formidable crave-crusher."},{"entryId":"3083388","name":"Bk Double Stacker","description":"Step up to 2 patties, 1 slice of cheese & 2 half slices of bacon smothered in bk stacker sauce. the second story of meaty, cheesy, bacony deliciousness ensures massive hunger destruction."},{"entryId":"3083389","name":"Bk Triple Stacker","description":"This mountainous monument of meat boasts 3 patties, 2 slices of cheese & 2 half slices of bacon all smothered in bk stacker sauce. this shrine of meaty cheesy, goodness is sure to satisfy even the most discerning of meatatarians."},{"entryId":"3083390","name":"Hamburger","description":"Start with a flame-broiled beef patty, add crunchy pickles.  finish with yellow mustard and ketchup on a sesame seed bun. perfect if youre not into cheese, or if you just have a taste for the understated.  whatever the reason, have it your way."},{"entryId":"3083391","name":"Double Hamburger","description":"Two flame-broiled patties, crunchy pickles, red ketchup, yellow mustard  put it all together, and you've got our double hamburger."},{"entryId":"3083392","name":"Cheeseburger","description":"The good ol burger king cheeseburger. crunchy pickles, red ketchup, yellow mustard, and fittingly, cheese  all on a sesame seed bun. you cant go wrong when you have it your way"},{"entryId":"3083393","name":"Double Cheeseburger","description":"What comes with a 1\/4 lb double cheeseburger? two beef patties, two slices of melted cheese, crunchy pickles, delicious ketchup and mustard, and the flame-fresh taste your stomach craves. based on pre-cooked patty weight"},{"entryId":"3083394","name":"Mushroom & Swiss Burger","description":"3.2 ounces of fire-grilled, seasoned beef topped with sauteed mushrooms, swiss cheese, and our original grill sauce. limited time only. at participating restaurants."},{"entryId":"3083395","name":"Western Bbq Cheeseburger","description":"3.2 ounces of fire-grilled, seasoned beef topped with onion rings, american cheese, and tangy bbq sauce. limited time only. at participating restaurants."},{"entryId":"3083396","name":"Deluxe Cheeseburger","description":"The deluxe cheeseburger is a 3.2 ounce of fire-grilled, seasoned beef topped with american cheese, lettuce, onions, pickles, and thousand island sauce. limited time only. at participating restaurants."},{"entryId":"3083397","name":"Bk Chefs Choice Burger","description":"A flame-broiled 5.5 oz burger patty, made with usda certified ground chuck seasoned with salt and pepper, a thick slice american cheese, naturally-smoked thick cut bacon, fresh cut romaine lettuce, red onions and ripe tomatoes, our original grill sauce on an artisan bun. at participating restaurants."},{"entryId":"3083398","name":"Bacon & Cheddar Bk Toppers Burger","description":"3.2 ounces of fire-grilled beef, topped with melted cheddar cheese, thick-cut hardwood smoked bacon, mayonnaise, ketchup, and crispy pickles all on a warm, toasted bun."}]}},{"sectionId":"s441884","name":"Chicken Sandwiches","entries":{"count":6,"items":[{"entryId":"3083399","name":"Tendergrill Chicken Sandwich","description":"You want chicken? you got it. you want a juicy grilled chicken filet on ciabatta bread, topped with crisp lettuce and tomato? you got that, too. its called the tendergrill chicken sandwich."},{"entryId":"3083400","name":"Tendercrisp Chicken Sandwich On Artisan Bun","description":"Crispy on the outside, tender on the insidethe tendercrisp chicken sandwich is a premium white meat chicken filet with crisp breading, fresh lettuce, red ripe tomatoes, and mayo on a corn-dusted bun. it's chicken just the way you want it."},{"entryId":"3083401","name":"Spicy Chickn Crisp Sandwich","description":"A crispy chicken patty topped with garden-fresh iceberg lettuce and creamy mayo, all sandwiched in a fresh sesame seed bun. its got just the right amount of spicy kick. and at $1*, its also got just the right amount of price.  price and participation may vary. prices higher in ak & hi."},{"entryId":"3083402","name":"Original Chicken Sandwich","description":"Crispy premium white meat chicken topped with shredded lettuce, mayo, and served on a sesame seed bun. so good, we haven't changed it since 1979. how many sandwiches can say that?"},{"entryId":"3083403","name":"Club Chicken Sandwich","description":"Crispy premium white meat chicken topped with thick-cut bacon, tomato, shredded lettuce, mayo, and served on a sesame seed bun. a great new twist added to an all-time favorite."},{"entryId":"3083404","name":"Italian Chicken Sandwich","description":"Crispy premium white meat chicken topped with flavorful marinara sauce, mozzarella cheese and served on a sesame seed bun. a delicious new flavor added to an all-time favorite."}]}},{"sectionId":"s441885","name":"Other Favorites","entries":{"count":3,"items":[{"entryId":"3083405","name":"Chicken Tenders","description":"Four pieces, eight pieces, twenty pieces. but don't let that limit you. if you want 24 of the new, crispy chicken tenders, just order a twenty and a four. thirty-two? order a twenty, a four and an eight. what's that you ask? you want an odd number of chicken tenders? easy. order any amount, take one"},{"entryId":"3083406","name":"Bk Veggie Burger","description":"A morningstar farms garden veggie patty, garden crisp vegetables, whole grains, and spicesall topped with lettuce, red ripe tomatoes, ketchup, creamy mayo, and served on a sesame seed bun. if there's one thing we know, it's burgers. even veggie burgers. no, especially, the bk veggie burger."},{"entryId":"3083407","name":"Bk Big Fish","description":"A crisp, golden breaded 4.3-ounce filet, tangy tartar sauce, and fresh lettuce all served on a corn-dusted bun. the bk big fish commands attention, and delivers satisfaction. who are you to resist? based on pre-cooked filet weight."}]}},{"sectionId":"s441886","name":"Side Items","entries":{"count":3,"items":[{"entryId":"3083408","name":"French Fries - Salted (Medium)","description":"Enjoy golden brown, piping hot, crispy and tasty french fries with your favorite bk  value meal, or devour them as a side. dip them in ketchup, barbeque sauce, your shake, or nothing at all. we won't judge. just have it your way."},{"entryId":"3083409","name":"Onion Rings (Medium)","description":"Served hot and crispy, onion rings are the perfect round, tasty treat for plunging into zesty dipping sauce. or maybe you prefer barbeque sauce? or honey mustard? just have it your way."},{"entryId":"3083410","name":"Garden Salad","description":"Man doesnt live on flame-broiled burgers alone. try the bk  garden salad as a satisfying accompaniment to any meal. or as a meal in itself. croutons are included in nutritional information. * price and participation may vary. prices higher in ak & hi."}]}},{"sectionId":"s441887","name":"Desserts","entries":{"count":6,"items":[{"entryId":"3083411","name":"Dutch Apple Pie","description":"Hot and gooey apple filling in a flaky baked crust. and on top of that, it's dutch. so you know it's delicious."},{"entryId":"3083412","name":"Hershey's Sundae Pie","description":"Take a crunchy chocolate crust, add in chocolate filling, then take a crunchy chocolate crust, add in chocolate filling, then top it off with whipped cream and hersheys chocolate chips. chocolate lovers: give a warm welcome to the hersheys sundae pie. the hersheys trademark and trade dress are used under license by burger king corporation."},{"entryId":"3083413","name":"Oreo Sundae","description":"Cool and creamy vanilla soft serve is layered between chocolate fudge and topped with oreo cookie pieces. at participating restaurants."},{"entryId":"3083414","name":"Oreo Brownie Sundae","description":"A chocolate oreo brownie is topped with cool and creamy vanilla soft serve and chocolate fudge. at participating restaurants."},{"entryId":"3083415","name":"Peach and Granola Sundae","description":"Cool and creamy vanilla soft serve is layered between sweet peach toppings and topped with crunchy granola. at participating restaurants."},{"entryId":"3083416","name":"Strawberry Hand Spun Shake","description":"Cool and creamy strawberry shakes are hand spun and topped with whipped topping. at participating restaurants."}]}}]}}]}}}}